YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/b_mcal_nxp_S32K3xx/b_mcal_Base_nxp_S32K3xx/header/S32M27x_SIUL2.h
#define SIUL2_UDR1_UDR31_MASK                    (0x80000000U)
#define SIUL2_UDR1_UDR31_SHIFT                   (31U)
#define SIUL2_UDR1_UDR31_WIDTH                   (1U)
#define SIUL2_UDR1_UDR31(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR1_UDR31_SHIFT)) & SIUL2_UDR1_UDR31_MASK)
/*! @} */

/*! @name UDR0 - SIUL2 User Defined */
/*! @{ */

#define SIUL2_UDR0_UDR0_MASK                     (0x1U)
#define SIUL2_UDR0_UDR0_SHIFT                    (0U)
#define SIUL2_UDR0_UDR0_WIDTH                    (1U)
#define SIUL2_UDR0_UDR0(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR0_SHIFT)) & SIUL2_UDR0_UDR0_MASK)

#define SIUL2_UDR0_UDR1_MASK                     (0x2U)
#define SIUL2_UDR0_UDR1_SHIFT                    (1U)
#define SIUL2_UDR0_UDR1_WIDTH                    (1U)
#define SIUL2_UDR0_UDR1(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR1_SHIFT)) & SIUL2_UDR0_UDR1_MASK)

#define SIUL2_UDR0_UDR2_MASK                     (0x4U)
#define SIUL2_UDR0_UDR2_SHIFT                    (2U)
#define SIUL2_UDR0_UDR2_WIDTH                    (1U)
#define SIUL2_UDR0_UDR2(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR2_SHIFT)) & SIUL2_UDR0_UDR2_MASK)

#define SIUL2_UDR0_UDR3_MASK                     (0x8U)
#define SIUL2_UDR0_UDR3_SHIFT                    (3U)
#define SIUL2_UDR0_UDR3_WIDTH                    (1U)
#define SIUL2_UDR0_UDR3(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR3_SHIFT)) & SIUL2_UDR0_UDR3_MASK)

#define SIUL2_UDR0_UDR4_MASK                     (0x10U)
#define SIUL2_UDR0_UDR4_SHIFT                    (4U)
#define SIUL2_UDR0_UDR4_WIDTH                    (1U)
#define SIUL2_UDR0_UDR4(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR4_SHIFT)) & SIUL2_UDR0_UDR4_MASK)

#define SIUL2_UDR0_UDR5_MASK                     (0x20U)
#define SIUL2_UDR0_UDR5_SHIFT                    (5U)
#define SIUL2_UDR0_UDR5_WIDTH                    (1U)
#define SIUL2_UDR0_UDR5(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR5_SHIFT)) & SIUL2_UDR0_UDR5_MASK)

#define SIUL2_UDR0_UDR6_MASK                     (0x40U)
#define SIUL2_UDR0_UDR6_SHIFT                    (6U)
#define SIUL2_UDR0_UDR6_WIDTH                    (1U)
#define SIUL2_UDR0_UDR6(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR6_SHIFT)) & SIUL2_UDR0_UDR6_MASK)

#define SIUL2_UDR0_UDR7_MASK                     (0x80U)
#define SIUL2_UDR0_UDR7_SHIFT                    (7U)
#define SIUL2_UDR0_UDR7_WIDTH                    (1U)
#define SIUL2_UDR0_UDR7(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR7_SHIFT)) & SIUL2_UDR0_UDR7_MASK)

#define SIUL2_UDR0_UDR8_MASK                     (0x100U)
#define SIUL2_UDR0_UDR8_SHIFT                    (8U)
#define SIUL2_UDR0_UDR8_WIDTH                    (1U)
#define SIUL2_UDR0_UDR8(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR8_SHIFT)) & SIUL2_UDR0_UDR8_MASK)

#define SIUL2_UDR0_UDR9_MASK                     (0x200U)
#define SIUL2_UDR0_UDR9_SHIFT                    (9U)
#define SIUL2_UDR0_UDR9_WIDTH                    (1U)
#define SIUL2_UDR0_UDR9(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR9_SHIFT)) & SIUL2_UDR0_UDR9_MASK)

#define SIUL2_UDR0_UDR10_MASK                    (0x400U)
#define SIUL2_UDR0_UDR10_SHIFT                   (10U)
#define SIUL2_UDR0_UDR10_WIDTH                   (1U)
#define SIUL2_UDR0_UDR10(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR10_SHIFT)) & SIUL2_UDR0_UDR10_MASK)

#define SIUL2_UDR0_UDR11_MASK                    (0x800U)
#define SIUL2_UDR0_UDR11_SHIFT                   (11U)
#define SIUL2_UDR0_UDR11_WIDTH                   (1U)
#define SIUL2_UDR0_UDR11(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR11_SHIFT)) & SIUL2_UDR0_UDR11_MASK)

#define SIUL2_UDR0_UDR12_MASK                    (0x1000U)
#define SIUL2_UDR0_UDR12_SHIFT                   (12U)
#define SIUL2_UDR0_UDR12_WIDTH                   (1U)
#define SIUL2_UDR0_UDR12(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR12_SHIFT)) & SIUL2_UDR0_UDR12_MASK)

#define SIUL2_UDR0_UDR13_MASK                    (0x2000U)
#define SIUL2_UDR0_UDR13_SHIFT                   (13U)
#define SIUL2_UDR0_UDR13_WIDTH                   (1U)
#define SIUL2_UDR0_UDR13(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR13_SHIFT)) & SIUL2_UDR0_UDR13_MASK)

#define SIUL2_UDR0_UDR14_MASK                    (0x4000U)
#define SIUL2_UDR0_UDR14_SHIFT                   (14U)
#define SIUL2_UDR0_UDR14_WIDTH                   (1U)
#define SIUL2_UDR0_UDR14(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR14_SHIFT)) & SIUL2_UDR0_UDR14_MASK)

#define SIUL2_UDR0_UDR15_MASK                    (0x8000U)
#define SIUL2_UDR0_UDR15_SHIFT                   (15U)
#define SIUL2_UDR0_UDR15_WIDTH                   (1U)
#define SIUL2_UDR0_UDR15(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR15_SHIFT)) & SIUL2_UDR0_UDR15_MASK)

#define SIUL2_UDR0_UDR16_MASK                    (0x10000U)
#define SIUL2_UDR0_UDR16_SHIFT                   (16U)
#define SIUL2_UDR0_UDR16_WIDTH                   (1U)
#define SIUL2_UDR0_UDR16(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR16_SHIFT)) & SIUL2_UDR0_UDR16_MASK)

#define SIUL2_UDR0_UDR17_MASK                    (0x20000U)
#define SIUL2_UDR0_UDR17_SHIFT                   (17U)
#define SIUL2_UDR0_UDR17_WIDTH                   (1U)
#define SIUL2_UDR0_UDR17(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR17_SHIFT)) & SIUL2_UDR0_UDR17_MASK)

#define SIUL2_UDR0_UDR18_MASK                    (0x40000U)
#define SIUL2_UDR0_UDR18_SHIFT                   (18U)
#define SIUL2_UDR0_UDR18_WIDTH                   (1U)
#define SIUL2_UDR0_UDR18(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR18_SHIFT)) & SIUL2_UDR0_UDR18_MASK)

